#Напишите программу, которая найдёт произведение пар чисел списка. 
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]

import random
a = int(input('Введите кол-во чисел в списке: '))
list_a = list(random.randint(0, 10) for i in range(a))
print(list_a)
comp_a = list(list_a[i]*list_a[-1*(1+i)] for i in range(a//2+1*(a%2)))
print(comp_a)